<a href="https://colab.research.google.com/github/ReemOmer/25daysofMLDS/blob/main/Day1in25.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Pandas

In [ ]:
import warnings
import pandas as pd

warnings.filterwarnings('ignore')

Pandas is a python package that help in working with labelled and structured data. Pandas deals with series, dataframes and panels.

In [ ]:
# create series with an array
import numpy as np
data = pd.Series(np.array(['test1','test2']))
print(data)

0    test1
1    test2
dtype: object

In [ ]:
# change index of series
data = pd.Series(np.array(['test1','test2']), index=[1,2])
data

1    test1
2    test2
dtype: object

In [ ]:
# creating a series with dictionary
data = {'a':0.,'b':1.,'c':2.}
data = pd.Series(data)

In [ ]:
s = pd.Series(5,index=[0,1,2,3])
s

0    5
1    5
2    5
3    5
dtype: int64

In [ ]:
s = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
print(s[0])
print(s[:2])
print(s[-2:])

1
a    1
b    2
dtype: int64
d    4
e    5
dtype: int64

In [ ]:
data

a    0.0
b    1.0
c    2.0
dtype: float64

### Functions

In [ ]:
print(s.axes)
print(s.values)
print(s.empty)
print(pd.Series().empty)
print(s.ndim) # the default value for series dimension is 1, index is not counted
print(s.size) # the length of the series
print(s.head(2))
print(s.tail(2))

[Index(['a', 'b', 'c', 'd', 'e'], dtype='object')]
[1 2 3 4 5]
False
True
1
5
a    1
b    2
dtype: int64
d    4
e    5
dtype: int64

Series is a type of list in pandas which can take integer values, string values, double values and more. ... Series can only contain single list with index, whereas dataframe can be made of more than one series or we can say that a dataframe is a collection of series that can be used to analyse the data.

Dataframes like SQL or spreadsheets.

In [ ]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [ ]:
df = pd.DataFrame([1,2,3,4,5,6])
print(df)

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [ ]:
mydf = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(mydf, columns=['Name','Age'])
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [ ]:
# create df from dictionary with index

data = {'Name':['Tom','Jack','Steve','Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data,index=['record1','record2','record3','record4'])
df

          Name  Age
record1    Tom   28
record2   Jack   34
record3  Steve   29
record4  Ricky   42

In [ ]:
d = {'one':pd.Series([1,2,3],index=['a','b','c']),'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [ ]:
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [ ]:
print(df['one']['c'])
print(df['one'][3])

3.0
nan

In [ ]:
print(df[df['one']>2]) # the returned values are conditioned to be larger than 2

   one  two
c  3.0    3

In [ ]:
df['three'] = pd.Series([10,20,30],index=['a','c','d'])
df

   one  two  three
a  1.0    1   10.0
b  2.0    2    NaN
c  3.0    3   20.0
d  NaN    4   30.0

In [ ]:
# create new column out of the existing ones
df['four'] = df['one']+df['three']
df

   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2    NaN   NaN
c  3.0    3   20.0  23.0
d  NaN    4   30.0   NaN

In [ ]:
df

   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2    NaN   NaN
c  3.0    3   20.0  23.0
d  NaN    4   30.0   NaN

### Deleting columns

In [ ]:
del df['four']
df

   one  two  three
a  1.0    1   10.0
b  2.0    2    NaN
c  3.0    3   20.0
d  NaN    4   30.0

In [ ]:
df.pop('three')

a    10.0
b     NaN
c    20.0
d    30.0
Name: three, dtype: float64

In [ ]:
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

### Transpose, Axes, dtypes

In [ ]:
dictionary = {
    'Name':pd.Series(['Alaa','Sarah','Ali','Sami']),
    'Age':pd.Series([13,20,17,15])
}

df = pd.DataFrame(dictionary)
print(df)
print(df.T)

    Name  Age
0   Alaa   13
1  Sarah   20
2    Ali   17
3   Sami   15
         0      1    2     3
Name  Alaa  Sarah  Ali  Sami
Age     13     20   17    15

In [ ]:
df.axes

[RangeIndex(start=0, stop=4, step=1), Index(['Name', 'Age'], dtype='object')]

In [ ]:
df.dtypes

Name    object
Age      int64
dtype: object

In [ ]:
df.empty

False

In [ ]:
df.ndim, df.shape, df.size

(2, (4, 2), 8)

In [ ]:
df.values

array([['Alaa', 13],
       ['Sarah', 20],
       ['Ali', 17],
       ['Sami', 15]], dtype=object)

In [ ]:
df

    Name  Age
0   Alaa   13
1  Sarah   20
2    Ali   17
3   Sami   15

In [ ]:
df.head(2)

    Name  Age
0   Alaa   13
1  Sarah   20

In [ ]:
df.tail(2)

   Name  Age
2   Ali   17
3  Sami   15

### Descriptive statistics

In [ ]:
df

    Name  Age
0   Alaa   13
1  Sarah   20
2    Ali   17
3   Sami   15

In [ ]:
df.count()

Name    4
Age     4
dtype: int64

In [ ]:
df.sum()

Name    AlaaSarahAliSami
Age                   65
dtype: object

In [ ]:
df.mean()

Age    16.25
dtype: float64

In [ ]:
df.median()

Age    16.0
dtype: float64

In [ ]:
df.mode()

    Name  Age
0   Alaa   13
1    Ali   15
2   Sami   17
3  Sarah   20

In [ ]:
df

    Name  Age
0   Alaa   13
1  Sarah   20
2    Ali   17
3   Sami   15

In [ ]:
df1 = {'Name':'Test','Age':13}
df3 = df.append(df1, ignore_index=True)
df3

    Name  Age
0   Alaa   13
1  Sarah   20
2    Ali   17
3   Sami   15
4   Test   13

In [ ]:
df3

    Name  Age
0   Alaa   13
1  Sarah   20
2    Ali   17
3   Sami   15
4   Test   13

In [ ]:
df3.mode()

    Name   Age
0   Alaa  13.0
1    Ali   NaN
2   Sami   NaN
3  Sarah   NaN
4   Test   NaN

In [ ]:
df.std()

Age    2.986079
dtype: float64

In [ ]:
df

    Name  Age
0   Alaa   13
1  Sarah   20
2    Ali   17
3   Sami   15

In [ ]:
df.min()

Name    Alaa
Age       13
dtype: object

In [ ]:
df.max()

Name    Sarah
Age        20
dtype: object

In [ ]:
df['Age'].abs()

0    13
1    20
2    17
3    15
Name: Age, dtype: int64

In [ ]:
df.prod()

Age    66300
dtype: int64

In [ ]:
df['Age'].cumprod()

0       13
1      260
2     4420
3    66300
Name: Age, dtype: int64

In [ ]:
df.describe()

             Age
count   4.000000
mean   16.250000
std     2.986079
min    13.000000
25%    14.500000
50%    16.000000
75%    17.750000
max    20.000000

### Function Application

### Use Pipe/Apply to apply function over all elements in df

In [ ]:
def addTwo(x, num=2):
  return x+num

In [ ]:
df1 = pd.DataFrame(np.array([1,2,3]), columns=['Numbers'])
df1.pipe(addTwo, 2)

   Numbers
0        3
1        4
2        5

In [ ]:
df1.apply(addTwo)

   Numbers
0        3
1        4
2        5

In [ ]:
df1.apply(np.sum)

Numbers    6
dtype: int64

In [ ]:
df1.apply(lambda x:x+2)

   Numbers
0        3
1        4
2        5

In [ ]:
df1.applymap(lambda x:x+2)

   Numbers
0        3
1        4
2        5

### Sorting by label/value

In [ ]:
# generate 10*2 random numbers (resulted in an array) which will be converted to df with the given index
unsorted_df=pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7])
unsorted_df

          0         1
1 -1.015761  0.345143
4  0.258151 -0.121093
6 -0.586964  0.634202
2  0.745584  1.372453
3 -0.982981 -1.158875
5 -0.219661  1.418261
9 -0.029971  0.791903
8 -0.344788  0.424133
0 -0.633768  1.249953
7 -1.024504  0.987110

In [ ]:
unsorted_df.sort_index()

          0         1
0 -0.633768  1.249953
1 -1.015761  0.345143
2  0.745584  1.372453
3 -0.982981 -1.158875
4  0.258151 -0.121093
5 -0.219661  1.418261
6 -0.586964  0.634202
7 -1.024504  0.987110
8 -0.344788  0.424133
9 -0.029971  0.791903

In [ ]:
unsorted_df.sort_index(ascending=False)

          0         1
9 -0.029971  0.791903
8 -0.344788  0.424133
7 -1.024504  0.987110
6 -0.586964  0.634202
5 -0.219661  1.418261
4  0.258151 -0.121093
3 -0.982981 -1.158875
2  0.745584  1.372453
1 -1.015761  0.345143
0 -0.633768  1.249953

In [ ]:
unsorted_df.sort_values(by=1, ascending=False)

          0         1
5 -0.219661  1.418261
2  0.745584  1.372453
0 -0.633768  1.249953
7 -1.024504  0.987110
9 -0.029971  0.791903
6 -0.586964  0.634202
8 -0.344788  0.424133
1 -1.015761  0.345143
4  0.258151 -0.121093
3 -0.982981 -1.158875

In [ ]:
 unsorted_df.sort_values(by=[0,1], ascending=False)

          0         1
2  0.745584  1.372453
4  0.258151 -0.121093
9 -0.029971  0.791903
5 -0.219661  1.418261
8 -0.344788  0.424133
6 -0.586964  0.634202
0 -0.633768  1.249953
3 -0.982981 -1.158875
1 -1.015761  0.345143
7 -1.024504  0.987110